{"title":"产品领导者的五种特质","slug":"管理/产品领导者的五种特质","date":"2015-11-27T10:24:44.000Z","updated":"2018-03-28T07:42:14.000Z","comments":true,"path":"api/articles/管理/产品领导者的五种特质.json","excerpt":"1.善于观察他们一直在观察用户，不仅仅是借助指标和仪表盘。他们对每件小事情感到好奇：用户正尝试完成什么？  为什么用户选择这款产品而非其它产品？  他们在和这款产品交互之前、之中和之后，做了什么。  他们查看收到的每一条反馈，对每个客户问题做出响应。他们创建让人愉悦的调查，知道该问什么，什么时候该倾听或无视。他们在 Facebook 上和用户交朋友——他们能叫得出用户名字。他们深知，核心用户会成为产品本身的一部分。他们痴迷于研究。他们知道市场的运作方式、未来走向以及竞争要做什么。他们密切注视着一切，除了没有创建一个显而易见的版本。","covers":null,"content":"<script src=\"/assets/js/APlayer.min.js\"> </script><h4 id=\"1-善于观察\"><a href=\"#1-善于观察\" class=\"headerlink\" title=\"1.善于观察\"></a>1.善于观察</h4><p>他们一直在观察用户，不仅仅是借助指标和仪表盘。他们对每件小事情感到好奇：</p>\n<ul>\n<li>用户正尝试完成什么？  </li>\n<li>为什么用户选择这款产品而非其它产品？  </li>\n<li>他们在和这款产品交互之前、之中和之后，做了什么。  </li>\n</ul>\n<p>他们查看收到的每一条反馈，对每个客户问题做出响应。他们创建让人愉悦的调查，知道该问什么，什么时候该倾听或无视。他们在 Facebook 上和用户交朋友——他们能叫得出用户名字。他们深知，核心用户会成为产品本身的一部分。</p>\n<p>他们痴迷于研究。他们知道市场的运作方式、未来走向以及竞争要做什么。他们密切注视着一切，除了没有创建一个显而易见的版本。</p>\n<a id=\"more\"></a>\n<h4 id=\"2-技术\"><a href=\"#2-技术\" class=\"headerlink\" title=\"2.技术\"></a>2.技术</h4><p>他们或许没有计算机科学学位，但是凭借其悟性，足以解释事物运作的方式。他们理解软件开发的过程（和复杂度），打造增量改变的文化，还能借助可用的数据点清晰明了地交流。他们对优先级毫不留情。</p>\n<p>他们是脚本瘾君子——他们能够不依赖工程师而自动化很多工作。为了检查产品，他们创造工具，最终成为每个人手头最重要的工具。</p>\n<p>他们在工程师圈子里保持良好联系——知道从哪儿得到某些工程师的快速帮助、或雇佣到全职的明星工程师。</p>\n<p>他们明白，写代码除了开发产品——还能节约大量时间。</p>\n<h4 id=\"3-分析\"><a href=\"#3-分析\" class=\"headerlink\" title=\"3.分析\"></a>3.分析</h4><p>他们或许不是正式的数据科学家，但他们是数据狂热者。他们理解大数据和不良数据的差异。他们对各种分析工具一点儿也不陌生，为了捕捉到有意义的数据，他们知道该增加什么或何时增加。</p>\n<p>他们熟悉足够多的数据工具和框架，能够快速分析，并找到见解。他们总是寻找盲点。他们做出数据启迪、而非数据驱动的决定。</p>\n<p>他们和数据科学社区保持良好联系——他们知道从哪儿能得到快速的数据科学方面的帮助，以及雇佣到明星数据科学家。</p>\n<p>他们明白，大量的数据分析只用 web 浏览器就能快速搞定。</p>\n<h4 id=\"4-聚焦设计\"><a href=\"#4-聚焦设计\" class=\"headerlink\" title=\"4.聚焦设计\"></a>4.聚焦设计</h4><p>他们可能不是视觉设计师，但是理解设计的真谛及其重要性。他们知道，好的设计不单单取决于优秀的设计师，而要在团队内部打造一种强烈的设计文化。他们理解，好的设计花费时间，也知道良好、完美与完成之间的区别。</p>\n<p>他们熟悉快速设计的工具，除了编写产品说明，还能够清晰地为振奋人心的想法和概念添加插图。他们不断地寻找设计灵感，他们激发着设计师。</p>\n<p>他们和设计社区保持良好联系——他们知道从哪儿能得到快速的兼职设计方面的帮助，以及雇佣到优秀的全职设计师。</p>\n<p>他们明白，设计不单单是设计师的工作——它是团队每个人的心态和文化。</p>\n<h4 id=\"5-企业家精神\"><a href=\"#5-企业家精神\" class=\"headerlink\" title=\"5.企业家精神\"></a>5.企业家精神</h4><p>他们或许还没有打造过十亿美元的业务，但是已经上线了、并使得至少一款产品取得了增长（他们自己出钱），并以此为荣，即使没有上线亦如此。他们乐于介绍过程——为什么世界需要他们的产品、他们怎样获取用户、效果不佳的问题在哪儿。</p>\n<p>他们相信，世界真的是平的，渴望成功。他们以之前的作品为荣，但是在内心深处藏着更大的欲望，那就是为十亿用户开发产品，让世界变得更美好。</p>\n<p>他们明白，在拥有的全部技能中，勇气和坚持不懈才是最重要的两个特点。</p>\n","categories":[{"name":"管理","path":"api/categories/管理.json"}],"tags":[{"name":"管理","path":"api/tags/管理.json"}]}