{"title":"在IOS中像SnapChat一样监控screenshots","slug":"iOS/在IOS中像SnapChat一样监控screenshots","date":"2014-06-10T18:45:37.000Z","updated":"2018-03-28T07:42:14.000Z","comments":true,"path":"api/articles/iOS/在IOS中像SnapChat一样监控screenshots.json","excerpt":"A number of Stack  Overflowquestions were having issues with this, so I figured I’d explain. From reverse engineering, this is the exact method used by SnapChat, but it’s also pretty much what I’d have done myself.<br>","covers":null,"content":"<link rel=\"stylesheet\" href=\"/owl.css\"><link rel=\"stylesheet\" class=\"aplayer-secondary-style-marker\" href=\"/assets/css/APlayer.min.css\"><script src=\"/assets/js/APlayer.min.js\" class=\"aplayer-secondary-script-marker\"></script><script class=\"meting-secondary-script-marker\" src=\"/assets/js/Meting.min.js\"></script><p>A <a href=\"http://stackoverflow.com/questions/2121970/notification-of-or-detecting-screenshot-being-taken/2122117\" target=\"_blank\" rel=\"noopener\">number</a> of <a href=\"http://stackoverflow.com/questions/13484516/ios-detection-of-screenshot\" target=\"_blank\" rel=\"noopener\">Stack</a>  <a href=\"http://stackoverflow.com/questions/10122212/iphone-screenshot\" target=\"_blank\" rel=\"noopener\">Overflow</a>questions were having issues with this, so I figured I’d explain. From reverse engineering, this is the exact method used by SnapChat, but it’s also pretty much what I’d have done myself.<br><a id=\"more\"></a><br>The process is pretty simple, and relies on a quirk of iOS: taking a screenshot cancels all touches on the screen. Because of that, anything that you want to protect will require you to have the user to touch the screen to see. If that works for your purposes, the general solution is to simply intercept the touch cancellation, and quickly remove any sensitive information from the screen. If you’re also implementing a screenshot counter, as with SnapChat, you will also need to take into account the other cases when a touch might be cancelled: from a system gesture (Notification Center or the iPad’s multitasking gestures), or by activating other pieces of system UI (the power down menu, or the multitasking switcher).</p>\n<p>On a technical level, the two basic pieces are UILongPressGestureRecognizer (or -touchesCancelled:withEvent:, if you want) and UIApplicationDelegate. In your long press handler, you should hide your sensitive information when the gesture recognizer’s state is UIGestureRecognizerStateCancelled, and if you want to track the number of screenshots, increment a counter. Then, in the UIApplicationDelegate, decrement that counter when you receive the -applicationWillEnterBackground: or -applicationDidResignActive: notification to account for the other possibilities for a cancelled touch. You might also need to handle other situations where a touch could be cancelled, if other parts of your app might cause that to happen.</p>\n","categories":[{"name":"iOS","path":"api/categories/iOS.json"}],"tags":[{"name":"截屏","path":"api/tags/截屏.json"}]}